Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoRoofsSpacesBoundingWarn Property
 The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are space bounding, and make sure that the space offsets are high enough to include the roofs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRoofsSpacesBoundingWarn { get; }
Public Shared ReadOnly Property NoRoofsSpacesBoundingWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRoofsSpacesBoundingWarn {
	FailureDefinitionId^ get ();
}
static member NoRoofsSpacesBoundingWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace